# SlabShapeVertexArrayIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeVertexArrayIterator Class
Members See Also
---
An iterator to an array of vertices used for Slab Shape Editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class SlabShapeVertexArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class SlabShapeVertexArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class SlabShapeVertexArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..SlabShapeVertexArrayIterator
# See Also
SlabShapeVertexArrayIterator Members
Autodesk.Revit.DB Namespace